import React from "react";
import style from "./Info.module.scss";

function Info() {
  return (
    <div className={style.info}>
      {/* privaticy */}
      <div className={style.infoPage}>
        <h1>Політика конфіденційності та правила користування сайтом</h1>
        <h2>1. Користувач та дані:</h2>
        <ul>
          <li>
            Згода на обробку персональних даних при оформленні замовлення.
          </li>
          <li>
            Використання інформації лише для виконання зобов'язань компанії.
          </li>
          <li>Не передається третім особам.</li>
        </ul>
        <h2>2. Обробка та передача даних:</h2>
        <ul>
          <li>
            Згода на обробку та передачу даних для виконання угод та рекламних
            цілей.
          </li>
          <li>
            Згода надається через відповідні графи при оформленні замовлення.
          </li>
          <li>
            Сайт не несе відповідальності за інформацію, яку користувач надає у
            загальнодоступній формі.
          </li>
        </ul>
        <h2>3. Використання Cookies та збір інформації:</h2>
        <ul>
          <li>
            Файли cookie використовуються для поліпшення якості послуг,
            збереження налаштувань та відстеження популярних сторінок.
          </li>
          <li>
            Компанія "MaxRise" використовує файли cookie для рекламних цілей та
            може передавати їх за межі країни.
          </li>
        </ul>
        <h2>4. Збір автоматичної інформації:</h2>
        <p>
          При відвідуванні сайту користувач автоматично реєструється та передає
          інформацію для виконання укладених угод. Це включає IP-адресу, тип та
          мову браузера, дату та час запиту, файли cookie.
        </p>
        <h2>5. Розсилка та інформаційні повідомлення:</h2>
        <ul>
          <li>
            Згода на отримання інформаційних розсилок при реєстрації на сайті.
          </li>
          <li>
            Ці розсилки включають оголошення про майбутні акції, розіграші та
            інші події, що відбуваються на сайті.
          </li>
          <li>
            Користувач може відмовитися від отримання розсилок в будь-який час,
            звернувшись до служби підтримки.
          </li>
        </ul>
        <h2>6. Взаємодія з законодавством України:</h2>
        <ul>
          <li>
            Компанія «MaxRise» дотримується вимог Закону «Про захист
            персональних даних».
          </li>
          <li>
            Зберігаємо, використовуємо та розголошуємо інформацію користувачів
            лише у випадках, передбачених законом.
          </li>
        </ul>
        <h2>7. Доступ до особистих даних:</h2>
        <ul>
          <li>
            Користувач завжди має доступ до своїх особистих даних на сайті
            "MaxRise".
          </li>
          <li>
            Можливість видалити або змінити дані, якщо вони вказані невірно.
          </li>
        </ul>
      </div>
      {/* Rules */}
      <div className={style.infoPage}>
        <h1>Правила користування сайтом:</h1>

        <h2>Конфіденційність та безпека:</h2>
        <ul>
          <li>
            Користувач несе відповідальність за збереження конфіденційності
            свого облікового запису та пароля.
          </li>
          <li>Заборонено надавати свої облікові дані третім особам.</li>
        </ul>

        <h2>Використання ресурсів сайту:</h2>
        <ul>
          <li>
            Користувач може використовувати ресурси сайту лише для особистих
            цілей та згідно з його призначенням.
          </li>
          <li>
            Весь вміст сайту, включаючи текст, графіку та інші матеріали,
            захищений авторським правом.
          </li>
        </ul>

        <h2>Оплата та сервіси:</h2>
        <ul>
          <li>
            Інформація про ціни на послуги повинна бути чітко вказана на сайті.
          </li>
          <li>
            Оплата за послуги повинна бути проведена згідно з умовами, вказаними
            на сайті.
          </li>
          <li>
            Після здійснення оплати за надані послуги відбувається надання
            доступу до онлайн тренувань та інших ресурсів.
          </li>
          <li>
            Оплата вважається остаточною, і немає можливості повернення коштів.
          </li>
        </ul>

        <h2>Комунікація з тренером:</h2>
        <ul>
          <li>
            Користувач може взаємодіяти з тренером через вказані на сайті засоби
            комунікації.
          </li>
        </ul>

        <h2>Відповідальність:</h2>
        <ul>
          <li>
            Сайт не несе відповідальності за будь-які травми чи здоров'я
            користувача в результаті виконання вправ чи рекомендацій тренера.
          </li>
        </ul>

        <h2>Зміни та відмова від послуг:</h2>
        <ul>
          <li>
            Сайт залишає за собою право вносити зміни у вмісті, цінах чи умовах
            надання послуг.
          </li>
          <li>
            Користувач може відмовитися від послуг за визначеними правилами.
          </li>
        </ul>

        <h2>Правила поведінки:</h2>
        <ul>
          <li>
            Користувачі повинні взаємодіяти з повагою до інших користувачів та
            тренерів.
          </li>
        </ul>

        <h2>Зміни у правилах:</h2>
        <ul>
          <li>
            Сайт може час від часу змінювати правила користування, і зміни
            будуть опубліковані на сайті.
          </li>
          <li>
            Ці правила є обов'язковими для всіх користувачів сайту персонального
            онлайн тренерства.
          </li>
          <li>Порушення правил може призвести до обмеження.</li>
        </ul>
      </div>
    </div>
  );
}

export default Info;
